; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	spectrograph0 - mode
	spectrograph1 - mode
	Star1 - direction
	GroundStation9 - direction
	GroundStation10 - direction
	Star7 - direction
	Star4 - direction
	Star3 - direction
	GroundStation0 - direction
	Star11 - direction
	GroundStation5 - direction
	Star8 - direction
	Star2 - direction
	GroundStation6 - direction
	Star12 - direction
	Phenomenon13 - direction
	Phenomenon14 - direction
	Star15 - direction
	Star16 - direction
	Star17 - direction
	Star18 - direction
)
(:init
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 Star11)
	(calibration_target instrument0 GroundStation5)
	(calibration_target instrument0 GroundStation10)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star8)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 Star4)
	(calibration_target instrument1 GroundStation5)
	(supports instrument2 spectrograph0)
	(supports instrument2 spectrograph1)
	(calibration_target instrument2 Star11)
	(calibration_target instrument2 Star7)
	(calibration_target instrument2 GroundStation10)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star1)
	(supports instrument3 spectrograph1)
	(supports instrument3 spectrograph0)
	(calibration_target instrument3 GroundStation6)
	(calibration_target instrument3 GroundStation0)
	(calibration_target instrument3 Star3)
	(calibration_target instrument3 Star4)
	(supports instrument4 spectrograph0)
	(supports instrument4 spectrograph1)
	(calibration_target instrument4 Star11)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star4)
	(supports instrument5 spectrograph0)
	(supports instrument5 spectrograph1)
	(calibration_target instrument5 GroundStation6)
	(calibration_target instrument5 Star2)
	(calibration_target instrument5 Star8)
	(calibration_target instrument5 GroundStation5)
	(on_board instrument5 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star12)
)
(:goal (and
	(pointing satellite0 Phenomenon13)
	(pointing satellite1 Star4)
	(pointing satellite2 Phenomenon14)
	(have_image Star12 spectrograph1)
	(have_image Phenomenon13 spectrograph0)
	(have_image Phenomenon14 spectrograph0)
	(have_image Star15 spectrograph0)
	(have_image Star16 spectrograph1)
	(have_image Star17 spectrograph1)
	(have_image Star18 spectrograph1)
))

)

; plan
1. (switch_on instrument3 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument3)
   goals met: 0 of 10
2. (calibrate satellite2 instrument3 star4)
   added: (calibrated instrument3)
   goals met: 0 of 10
3. (turn_to satellite2 star15 star4)
   deleted: (pointing satellite2 star4)
   added: (pointing satellite2 star15)
   goals met: 0 of 10
4. (take_image satellite2 star15 instrument3 spectrograph0)
   added: (have_image star15 spectrograph0)
   goals met: 1 of 10
5. (turn_to satellite2 star12 star15)
   deleted: (pointing satellite2 star15)
   added: (pointing satellite2 star12)
   goals met: 1 of 10
6. (take_image satellite2 star12 instrument3 spectrograph1)
   added: (have_image star12 spectrograph1)
   goals met: 2 of 10
7. (turn_to satellite2 phenomenon13 star12)
   deleted: (pointing satellite2 star12)
   added: (pointing satellite2 phenomenon13)
   goals met: 2 of 10
8. (turn_to satellite1 star4 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 star4)
   goals met: 3 of 10
9. (turn_to satellite0 phenomenon13 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 phenomenon13)
   goals met: 4 of 10
10. (take_image satellite2 phenomenon13 instrument3 spectrograph0)
   added: (have_image phenomenon13 spectrograph0)
   goals met: 5 of 10
11. (turn_to satellite2 star16 phenomenon13)
   deleted: (pointing satellite2 phenomenon13)
   added: (pointing satellite2 star16)
   goals met: 5 of 10
12. (take_image satellite2 star16 instrument3 spectrograph1)
   added: (have_image star16 spectrograph1)
   goals met: 6 of 10
13. (turn_to satellite2 star17 star16)
   deleted: (pointing satellite2 star16)
   added: (pointing satellite2 star17)
   goals met: 6 of 10
14. (take_image satellite2 star17 instrument3 spectrograph1)
   added: (have_image star17 spectrograph1)
   goals met: 7 of 10
15. (turn_to satellite2 star18 star17)
   deleted: (pointing satellite2 star17)
   added: (pointing satellite2 star18)
   goals met: 7 of 10
16. (take_image satellite2 star18 instrument3 spectrograph1)
   added: (have_image star18 spectrograph1)
   goals met: 8 of 10
17. (turn_to satellite2 phenomenon14 star18)
   deleted: (pointing satellite2 star18)
   added: (pointing satellite2 phenomenon14)
   goals met: 9 of 10
18. (take_image satellite2 phenomenon14 instrument3 spectrograph0)
   added: (have_image phenomenon14 spectrograph0)
   goals met: 10 of 10
